cmsis-svd/cmsis-svd/data/Atmel/ATSAME70N19B.svd
            <register>
               <name>USBHS_SR</name>
               <description>General Status Register</description>
               <addressOffset>0x0804</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDERRI</name>
                     <description>Remote Device Connection Error Interrupt (Host mode only)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPEED</name>
                     <description>Speed Status (Device mode only)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SPEEDSelect</name>
                        <enumeratedValue>
                           <name>FULL_SPEED</name>
                           <description>Full-Speed mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_SPEED</name>
                           <description>High-Speed mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_SPEED</name>
                           <description>Low-Speed mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKUSABLE</name>
                     <description>UTMI Clock Usable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_SCR</name>
               <description>General Status Clear Register</description>
               <addressOffset>0x0808</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RDERRIC</name>
                     <description>Remote Device Connection Error Interrupt Clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBHS_SFR</name>
               <description>General Status Set Register</description>
               <addressOffset>0x080C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RDERRIS</name>
                     <description>Remote Device Connection Error Interrupt Set</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBUSRQS</name>
                     <description>VBUS Request Set</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>UTMI</name>
         <version>11300A</version>
         <description>USB Transmitter Interface Macrocell</description>
         <groupName>UTMI</groupName>
         <prependToName>UTMI_</prependToName>
         <baseAddress>0x400E0400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x34</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>UTMI_OHCIICR</name>
               <description>OHCI Interrupt Configuration Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RES0</name>
                     <description>USB PORTx Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARIE</name>
                     <description>OHCI Asynchronous Resume Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>APPSTART</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDPPUDIS</name>
                     <description>USB Device Pull-up Disable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UTMI_CKTRIM</name>
               <description>UTMI Clock Trimming Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FREQ</name>
                     <description>UTMI Reference Clock Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FREQSelect</name>
                        <enumeratedValue>
                           <name>XTAL12</name>
                           <description>12 MHz reference clock</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XTAL16</name>
                           <description>16 MHz reference clock</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
